test/fixture/dispute/update_dispute.json

[
  {
    "request": {
      "body": "{\"message\":\"bad charge\"}",
      "headers": {
        "Content-type": "application/json",
        "User-Agent": "OmiseElixir/0.5.2 Elixir/1.6.0-dev"
      },
      "method": "put",
      "options": {
        "recv_timeout": 60000,
        "connect_timeout": 60000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.omise.co/disputes/dspt_test_59uu9r7em9ynw5n6ce8"
    },
    "response": {
      "body": "{\n  \"object\": \"dispute\",\n  \"id\": \"dspt_test_59uu9r7em9ynw5n6ce8\",\n  \"livemode\": false,\n  \"location\": \"/disputes/dspt_test_59uu9r7em9ynw5n6ce8\",\n  \"amount\": 50000,\n  \"currency\": \"thb\",\n  \"status\": \"pending\",\n  \"transaction\": \"trxn_test_59uu9r7mkpj2ndax49d\",\n  \"message\": \"bad charge\",\n  \"reason_code\": \"goods_or_services_not_provided\",\n  \"reason_message\": \"Services not provided or Merchandise not received\",\n  \"charge\": \"chrg_test_59utsg0q0mf94fp2qvu\",\n  \"documents\": {\n    \"object\": \"list\",\n    \"from\": \"1970-01-01T00:00:00Z\",\n    \"to\": \"2017-11-04T12:09:31Z\",\n    \"offset\": 0,\n    \"limit\": 20,\n    \"total\": 0,\n    \"order\": null,\n    \"location\": \"/disputes/dspt_test_59uu9r7em9ynw5n6ce8/documents\",\n    \"data\": [\n\n    ]\n  },\n  \"created\": \"2017-11-04T12:09:06Z\",\n  \"closed_at\": null\n}\n",
      "headers": {
        "Cache-Control": "no-cache, no-store",
        "Content-Type": "application/json; charset=utf-8",
        "Date": "Sat, 04 Nov 2017 12:09:31 GMT",
        "Omise-Version": "2017-11-02",
        "Server": "nginx",
        "Status": "200 OK",
        "Strict-Transport-Security": "max-age=31536000; includeSubdomains; preload",
        "Vary": "Accept-Encoding",
        "X-Request-Id": "6b516519-3fde-47b5-8b54-d3a8f9f25562",
        "X-Runtime": "0.240018",
        "Content-Length": "785",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
